УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/смартУстановкаИндивидуальныхСкидокКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаИндивидуальныхСкидокКлиентов</name>
  <comment>#1323 смарт: Лопато 21.09.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <registerRecords>InformationRegister.смартИндивидуальныеСкидкиКлиентов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартИндивидуальныеСкидкиКлиентов/смартИндивидуальныеСкидкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИндивидуальныеСкидкиКлиентов</name>
  <comment>#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>#1870 смарт: Лопато 24.06.2024 //Доработать механизм выгрузки индивидуальных скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("Клиент") Тогда
			
			НоваяСтрокаКлиенты = Объект.Клиенты.Добавить();
			
			НоваяСтрокаКлиенты.Клиент = Параметры.Клиент;
			
		КонецЕсли;
			
		Если Параметры.Свойство("СписокСкидокДляСохранения") Тогда
			
			Для Каждого СтруктураСкидокДляСохранения Из Параметры.СписокСкидокДляСохранения Цикл

				НоваяСтрокаСкидки = Объект.Скидки.Добавить();
				
				НоваяСтрокаСкидки.Номенклатура   = СтруктураСкидокДляСохранения.Номенклатура;
				НоваяСтрокаСкидки.ПроцентСкидки  = СтруктураСкидокДляСохранения.ПроцентСкидки;
				НоваяСтрокаСкидки.НачалоДействия = СтруктураСкидокДляСохранения.НачалоДействия;
				
			КонецЦикла;
			
		КонецЕсли;	

	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
	     Или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		 
		ПроверитьКорректностьЗаполненияДокумента(Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Проведен Тогда
		ПроверитьКорректностьЗаполненияДокумента(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроцентСкидкиНаценки(Команда)
	
	МассивСтрок = Элементы.Скидки.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = Неопределено;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ЗаполнитьПроцентСкидкиНаценкиЗавершение", ЭтотОбъект, Новый Структура("МассивСтрок, ВыбранноеЗначение", МассивСтрок, ВыбранноеЗначение)), 
					  ВыбранноеЗначение, НСтр("ru = 'Введите процент скидки (наценки)'"), 5, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроцентСкидкиНаценкиЗавершение(Число, ДополнительныеПараметры) Экспорт
    
    МассивСтрок = ДополнительныеПараметры.МассивСтрок;
    ВыбранноеЗначение = ?(Число = Неопределено, ДополнительныеПараметры.ВыбранноеЗначение, Число);
    
    Если (Число <> Неопределено) Тогда
        
        Для Каждого НомерСтроки Из МассивСтрок Цикл
            СтрокаТЧ = Объект.Скидки.НайтиПоИдентификатору(НомерСтроки);
            СтрокаТЧ.ПроцентСкидки = ВыбранноеЗначение;
        КонецЦикла;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуНачалаДействия(Команда)
	
	МассивСтрок = Элементы.Скидки.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = Неопределено;
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗаполнитьНачалоДействияЗавершение", ЭтотОбъект, Новый Структура("МассивСтрок, ВыбранноеЗначение", МассивСтрок, ВыбранноеЗначение)), 
					 ВыбранноеЗначение, НСтр("ru = 'Введите дату начала действия'"), ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачалоДействияЗавершение(Число, ДополнительныеПараметры) Экспорт
    
    МассивСтрок = ДополнительныеПараметры.МассивСтрок;
    ВыбранноеЗначение = ?(Число = Неопределено, ДополнительныеПараметры.ВыбранноеЗначение, Число);
    
    Если (Число <> Неопределено) Тогда
        
        Для Каждого НомерСтроки Из МассивСтрок Цикл
            СтрокаТЧ = Объект.Скидки.НайтиПоИдентификатору(НомерСтроки);
            СтрокаТЧ.НачалоДействия = ВыбранноеЗначение;
        КонецЦикла;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиСкидками(Команда)
	
	Если Объект.Скидки.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДействующимиСкидкамиЗавершение", ЭтотОбъект), 
					   "При заполнении будет очищена таблица скидок. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьДействующимиСкидкамиНаСервере();	
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиСкидкамиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДействующимиСкидкамиНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДействующимиСкидкамиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Клиент КАК Клиент,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Номенклатура КАК Номенклатура,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.ПроцентСкидки КАК ПроцентСкидки,
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.Период КАК НачалоДействия
		|ИЗ
		|	РегистрСведений.смартИндивидуальныеСкидкиКлиентов.СрезПоследних(&Дата, ) КАК смартИндивидуальныеСкидкиКлиентовСрезПоследних
		|ГДЕ
		|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.ПроцентСкидки <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоДействия,
		|	Клиент,
		|	Номенклатура,
		|	ПроцентСкидки
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    Объект.Скидки.Загрузить(РезультатЗапроса);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлиентовПоОтбору(Команда)
	
	ДополнительныеДанные = CRM_ОбщегоНазначенияКлиент.СтруктураДополнительныхДанных();
	ДополнительныеДанные.ИмяРеквизитаАдресОтбор = "АдресОтборКлиенты";
	ДополнительныеДанные.ИмяСправочника = "Партнеры";
	ДополнительныеДанные.Оповещение = Новый ОписаниеОповещения("ДобавитьКлиентовПоСКД", ЭтотОбъект);
	
	ОткрытьОтборЗаполненияКлиентов(ЭтотОбъект, ДополнительныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтборЗаполненияКлиентов(Форма, ДополнительныеДанные)
	
	ПараметрыСтруктура = Новый Структура();
	
	СтруктураСхемаКомпоновкиДанных = ПолучитьСтруктуруНастроекСхемыСКДИндивидуальныеСкидки("ОсновнаяСхемаКлиенты");
	
	ПараметрыСтруктура.Вставить("ТекстЗапроса", СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхЗапрос);
	ПараметрыСтруктура.Вставить("Заголовок", НСтр("ru='Настройка отбора клиентов'"));
	
	Если ЭтоАдресВременногоХранилища(Форма[ДополнительныеДанные.ИмяРеквизитаАдресОтбор]) Тогда
		ПараметрыСтруктура.Вставить("ОтборКомпоновкиДанных", ПолучитьИзВременногоХранилища(Форма[ДополнительныеДанные.ИмяРеквизитаАдресОтбор]));
	Иначе
		ПараметрыСтруктура.Вставить("ОтборКомпоновкиДанных", СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхОтборПоУмолчанию);
	КонецЕсли;
	
	ПараметрыСтруктура.Вставить("ДополнительныеПоля", Новый Массив);
	ПараметрыСтруктура.Вставить("ЗаголовокКомандыОК", НСтр("ru = 'Добавить'"));
	
	ДополнительныеДанные.Вставить("Форма", Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьОтборЗаполненияЗавершение", CRM_ОбщегоНазначенияКлиент, ДополнительныеДанные);
	ОткрытьФорму("ОбщаяФорма.CRM_ОтборКомпоновкиДанных", ПараметрыСтруктура, Форма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКлиентовПоСКД(Данные, ДополнительныеПараметры) Экспорт
	
	Если НЕ Данные.ОтборНастроен Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКлиентовПоСКДЗавершение(Неопределено, Данные);
			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКлиентовПоСКДЗавершение(Ответ, ДополнительныеПараметры) Экспорт
		
	Если ДополнительныеПараметры.Свойство("Форма") Тогда
		ДополнительныеПараметры.Удалить("Форма");
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Оповещение") Тогда
		ДополнительныеПараметры.Удалить("Оповещение");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Формирование списка клиентов'"),,
		НСтр("ru = 'Список сформирован.'")
	);
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизитаАдресОтбор]) Тогда
		ТекОтбор = ПолучитьИзВременногоХранилища(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизитаАдресОтбор]);
	Иначе
		ТекОтбор = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ТекОтбор) <> Тип("ОтборКомпоновкиДанных") Тогда
		ТекОтбор = Неопределено;
	КонецЕсли;
	
	СтруктураСхемаКомпоновкиДанных = ПолучитьСтруктуруНастроекСхемыСКДИндивидуальныеСкидки("ОсновнаяСхемаКлиенты");
	
	МассивСсылок = ПолучитьМассивСсылокПоОтборуСКД(СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхЗапрос, ТекОтбор, "Партнер"); 
	
	ДобавитьКлиентовПоРезультатуСКД(МассивСсылок);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлиентовПоРезультатуСКД(МассивСсылок)
	
	Для Каждого ЭлементСписка Из МассивСсылок Цикл
		
		НовыйКлиент = Объект.Клиенты.Добавить();
		НовыйКлиент.Клиент = ЭлементСписка;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоОтбору(Команда)
	
	ДополнительныеДанные = CRM_ОбщегоНазначенияКлиент.СтруктураДополнительныхДанных();
	ДополнительныеДанные.ИмяРеквизитаАдресОтбор = "АдресОтборНоменклатура";
	ДополнительныеДанные.ИмяСправочника = "Номенклатура";
	ДополнительныеДанные.Оповещение = Новый ОписаниеОповещения("ДобавитьНоменклатуруПоСКД", ЭтотОбъект);
	
	ОткрытьОтборЗаполненияНоменклатуры(ЭтотОбъект, ДополнительныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтборЗаполненияНоменклатуры(Форма, ДополнительныеДанные)
	
	ПараметрыСтруктура = Новый Структура();
	
	СтруктураСхемаКомпоновкиДанных = ПолучитьСтруктуруНастроекСхемыСКДИндивидуальныеСкидки("ОсновнаяСхемаНоменклатура");
	
	ПараметрыСтруктура.Вставить("ТекстЗапроса", СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхЗапрос);
	ПараметрыСтруктура.Вставить("Заголовок", НСтр("ru='Настройка отбора номенклатуры'"));
	
	Если ЭтоАдресВременногоХранилища(Форма[ДополнительныеДанные.ИмяРеквизитаАдресОтбор]) Тогда
		ПараметрыСтруктура.Вставить("ОтборКомпоновкиДанных", ПолучитьИзВременногоХранилища(Форма[ДополнительныеДанные.ИмяРеквизитаАдресОтбор]));
	Иначе
		ПараметрыСтруктура.Вставить("ОтборКомпоновкиДанных", СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхОтборПоУмолчанию);
	КонецЕсли;
	
	ПараметрыСтруктура.Вставить("ДополнительныеПоля", Новый Массив);
	ПараметрыСтруктура.Вставить("ЗаголовокКомандыОК", НСтр("ru = 'Добавить'"));
	
	ДополнительныеДанные.Вставить("Форма", Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьОтборЗаполненияЗавершение", CRM_ОбщегоНазначенияКлиент, ДополнительныеДанные);
	ОткрытьФорму("ОбщаяФорма.CRM_ОтборКомпоновкиДанных", ПараметрыСтруктура, Форма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоСКД(Данные, ДополнительныеПараметры) Экспорт
	
	Если НЕ Данные.ОтборНастроен Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНоменклатуруПоСКДЗавершение(Неопределено, Данные);
			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоСКДЗавершение(Ответ, ДополнительныеПараметры) Экспорт
		
	Если ДополнительныеПараметры.Свойство("Форма") Тогда
		ДополнительныеПараметры.Удалить("Форма");
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Оповещение") Тогда
		ДополнительныеПараметры.Удалить("Оповещение");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Формирование списка номенклатуры'"),,
		НСтр("ru = 'Список сформирован.'")
	);
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизитаАдресОтбор]) Тогда
		ТекОтбор = ПолучитьИзВременногоХранилища(ЭтаФорма[ДополнительныеПараметры.ИмяРеквизитаАдресОтбор]);
	Иначе
		ТекОтбор = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ТекОтбор) <> Тип("ОтборКомпоновкиДанных") Тогда
		ТекОтбор = Неопределено;
	КонецЕсли;
	
	СтруктураСхемаКомпоновкиДанных = ПолучитьСтруктуруНастроекСхемыСКДИндивидуальныеСкидки("ОсновнаяСхемаНоменклатура");

	МассивСсылок = ПолучитьМассивСсылокПоОтборуСКД(СтруктураСхемаКомпоновкиДанных.СхемаКомпоновкиДанныхЗапрос, ТекОтбор, "Номенклатура"); 
	
	ДобавитьНоменклатуруПоРезультатуСКД(МассивСсылок);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруПоРезультатуСКД(МассивСсылок)
	
	Для Каждого ЭлементСписка Из МассивСсылок Цикл
		
		НоваяНоменклатура = Объект.Скидки.Добавить();
		НоваяНоменклатура.Номенклатура = ЭлементСписка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруНастроекСхемыСКДИндивидуальныеСкидки(ИмяСхемы)

	СхемаКомпоновкиДанных = Документы.смартУстановкаИндивидуальныхСкидокКлиентов.ПолучитьМакет(ИмяСхемы);
	
	СтруктураСхемаКомпоновкиДанных = Новый Структура;
	СтруктураСхемаКомпоновкиДанных.Вставить("СхемаКомпоновкиДанныхЗапрос", 		     СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос);
	СтруктураСхемаКомпоновкиДанных.Вставить("СхемаКомпоновкиДанныхОтборПоУмолчанию", СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор);
	
	Возврат СтруктураСхемаКомпоновкиДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивСсылокПоОтборуСКД(СхемаКомпоновкиДанныхЗапрос, СхемаКомпоновкиДанныхОтбор, НаименованиеКолонки)
	
	ТаблицаПоОтбору = CRM_ОбщегоНазначенияСервер.ВыполнитьЗапросВКомпоновкеДанных(СхемаКомпоновкиДанныхЗапрос, СхемаКомпоновкиДанныхОтбор);	
	
	МассивСсылок = ТаблицаПоОтбору.ВыгрузитьКолонку(НаименованиеКолонки);	
	
	Возврат МассивСсылок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПроверитьКорректностьЗаполненияДокумента(Отказ)
	
КонецПроцедуры
